# CantCopyFromDetailToProfileFam Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..CopyPasteFailures..::..CantCopyFromDetailToProfileFam Property
BuiltInFailures..::..CopyPasteFailures Class See Also
---
Can't copy Detail element(s) into a Profile family.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CantCopyFromDetailToProfileFam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CantCopyFromDetailToProfileFam As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CantCopyFromDetailToProfileFam {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..CopyPasteFailures Class
Autodesk.Revit.DB Namespace